{"pageProps":{"data":{"name":"On-Off schedule with state persistence","description":"A simple on-off schedule, with the addition of state persistence across disruptive events, making sure the target device is always in the expected state."},"content":"\n# On-Off schedule with state persistence\n\n## Description\n\nThis blueprint provides a simple on-off schedule, with the addition of state persistence across server reboots, powercuts, or other disruptive events which could potentially alter the expected state of the targeted entities. The automation makes sure the target is always in the expected state, even in these situations, but always leaving the freedom to manually toggle the target state as desired. It can be used on critical targets which require a simple on-off schedule during every single day.\n\nOne common scenario where this could be useful is in the case of a server reboot or shutdown. For example, let's assume you've an automation _A_ set to turn on light _L_ at 12:00. If for whatever reason Home Assistant goes offline at 11:59 and turns back on at 12:01, automation _A_ scheduled for 12:00 is not executed, with the result of _L_ not being in the state you'd expect to be, after 12:00.\n\nUsing this blueprint in the above example would have guaranteed the expected behaviour, with the automation _A_ being run at Home Assistant startup, and setting the _L_ state as described by the schedule.\n\nExamples of disruptive scenarios could include server reboots, network outages or powercuts. Since every installation could be influenced by many different events and check for them in many different ways, the blueprints includes the flexibility to optionally supply a custom event type which the automation will listen to. When such event is fired, the automation is run.\n\nThe blueprint already implements the support for listening to Home Assistant startup events, but this functionality can be disabled as desired by the user.\n\nInternally, the blueprint calculates time ranges based on the provided On-Off times, bound to the target expected state. Whenever one of the specified times is reached or a disruptive event occurs, the automation retrieves the expected state from the calculated ranges, and enforces it on the target.\n\n## Requirements\n\nNo additional integrations or addons are required for this blueprint, since it's only based on the [Home Assistant Core Integration](https://www.home-assistant.io/integrations/homeassistant).\n\nIf you optionally want to supply a custom event type to the blueprint, you should setup a mechanism to fire the event in any situation a state check should be performed. This could be an integration firing an event, or another automation, so any additional required setup is out of scope of this documentation.\n\n## Inputs\n\n### Automation Target\n\nThe target which the automation will turn on and off based on the provided schedule. This include whatever can be specified as a target.\n\n### On Time\n\nTime when the target should be placed in the on state.\n\n### Off Time\n\nTime when the target should be placed in the off state.\n\n### Custom Trigger Event\n\n(Optional) A custom event which can trigger the state check (eg. a powercut event reported by external integrations). If you don't want to provide a custom event, simply leave this input blank.\n\n### Trigger at Home Assistant startup\n\nTrigger the target state check and enforcement at Home Assistant startup. Disabled by default.\n\n## Additional Notes\n\nThis automation only provides a simple On-Off schedule. More complex situations could require a different approach to the problem. Also, be aware that running multiple automations generated with this blueprint against the same target could result in unexpected behaviour.\n","category":"automation","id":"on_off_schedule_state_persistence","tocData":[{"content":"On-Off schedule with state persistence","slug":"on-off-schedule-with-state-persistence","lvl":1,"i":0,"seen":0},{"content":"Description","slug":"description","lvl":2,"i":1,"seen":0},{"content":"Requirements","slug":"requirements","lvl":2,"i":2,"seen":0},{"content":"Inputs","slug":"inputs","lvl":2,"i":3,"seen":0},{"content":"Automation Target","slug":"automation-target","lvl":3,"i":4,"seen":0},{"content":"On Time","slug":"on-time","lvl":3,"i":5,"seen":0},{"content":"Off Time","slug":"off-time","lvl":3,"i":6,"seen":0},{"content":"Custom Trigger Event","slug":"custom-trigger-event","lvl":3,"i":7,"seen":0},{"content":"Trigger at Home Assistant startup","slug":"trigger-at-home-assistant-startup","lvl":3,"i":8,"seen":0},{"content":"Additional Notes","slug":"additional-notes","lvl":2,"i":9,"seen":0}]},"__N_SSG":true}