{"pageProps":{"data":{"name":"Example Automation Blueprint","description":"A description for the blueprint"},"content":"\n# Example Automation Blueprint\n\n## Description\n\n_Describe here which goals your blueprint is trying to achieve. Provide also a brief description of how it works internally._\n\nThis example automation blueprint creates a persistent notification whenever the provided input boolean goes on.\n\n## Requirements\n\n_List here integrations, platforms, addons or any additional service which is strictly required to run this integration. Provide links for documentation about the requirement._\n\n### Persistent Notification Integration\n\n_Add here what this requirement is used for within the blueprint, as well as reference on how it should be configured to correctly integrate with the blueprint. It's advised to link to official documentation for the requirement here._\n\nYou must have this integration enabled on your system to run the automation. This should be activated by default so unless you tweaked the default configuration you're good to go.\n\n[Persistent Notification Integration Docs](https://www.home-assistant.io/integrations/persistent_notification/)\n\n## Inputs\n\n_List here and describe the inputs used by the blueprint._\n\n### Example Input Boolean\n\n_Add here the description for what the input is used for and its type/constraints._\n\nThe boolean input which will activate the automation.\n\n### Example Text\n\n_Add here the description for what the input is used for and its type/constraints._\n\nThe text which will be displayed as message in the persistent notification.\n\n## Additional Notes\n\n_Add here additional information about the blueprint (screenshots, tests, known limitations or issues)._\n\nThis blueprint describes a task which, as tested on my system, should execute quickly. If for some reason the automation is quite slow and it gets triggered another time, it just gets restarted.\n","category":"automation","id":"_example"},"__N_SSG":true}